'''4) შექმენით ფუნქცია, რომელიც მიიღებს მთელი რიცხვების სიას. შემდეგ თქვენ უნდა შექმნათ ახალი სია 
სადაც დაემატება საწყისი სიის რიცხვები: თუ საწყის სიაში რიცხვი ლუწია, მაშინ ახალ სიაში დაამატეთ ეს 
რიცხვი გაყოფილი ორზე ( /2), ხოლო თუ კენტია, ახალ სიაში დაამატეთ ეს რიცხვი გამრავლებული ორზე ( *2). 
ასეთი პირობით უნდა დაამატოთ ახალ სიაში საწყისი სიის ყველა რიცხვი და საბოლოოდ დააბრუნეთ ახალი სია

Test Cases:
[1, 2, 3, 4] -> [2, 1, 6, 2]
[5, 10, 3, 5] -> [10, 5, 6, 10]'''


def nlst(first_list):
    new_list=[]
    x=0
    for i in first_list:
        if i %2==0:
            x=i/2
        else:
            x=i*2
        new_list.append(int(x))
    
    return new_list

print(nlst([1, 2, 3, 4]))