'''შექმენით პროგრამა სადაც მომხმარებელს იქამდე შემოატანინებთ პაროლს სანამ არ იქნება ერს პაროლი სწორი 
როცა პაროლს სწორად შემოიტანს დაუბეჭდეთ რომ წარმატებით 
გაიარეს ავტორიზაცია წინააღმდეგ შემთხვევაში დაუწერეთ რომ პაროლი არასწორია კომენტარების საშუალებით ახსენით კოდის თითოეული დეტალი '''

correct_password="saba"
user_password=input("Enter password: ")

while correct_password!=user_password:
    print("პაროლი არასწორია")
    user_password=input("Enter password: ")
else:
    print("წარმატებით გაიარეთ ავტორიზაცია")

'''მომხმარებელს შემოვატანინებთ პაროლს და სანამ მისი პაროლი არ იქნება სწორი პაროლი 
მანამდე შემოვატანინებთ ახალახალ პაროლს და დავუწერთ პაროლი არასწორია, ხოლო როდესაც მის მიერ შემოტანილი 
პაროლი დამეთხვევა სწორ პაროლს მაშინ დავუწერთ რომ წარმატებით გაიარა ავტორიზაცია'''