'''შექმენით  ფუნქცია რომელსაც დაარქმევთ manual_count, ამ ფუნქციას გაუწერეთ ორი პარამეტრი პირველი 
string, count_char, პირველ პარამეტრეს გადაეცემა სტრინგი და მეორეს სიმბოლო რომელიც გვინდა დავითვალოთ, 
ფუნქციამ უნდა დაითვალოს სტრინგში დასათველელი სიმბოლოს რაოდენობა, არ გამოიყენოთ count მეთოდი, გააკეთეთ ეს დავალება  
for ციკლის დახმარებით, მიღებული შედეგი დააბრუნეთ return ის დახმარებით და დაბეჭდეთ დაბრუნებული მნიშვნელობა'''

def manual_count(txt, char):
    cnt=0
    for i in txt:
        if char == i:
            cnt=cnt+1
    return cnt

print(manual_count("saba", "a"))