/*1) შექმენით მინიმუმ 3 ობიექტი, მაგ ობიეტებში აღწერეთ კუთვნილებების დახმარებით თქვენი 3 მეგობარი, 
ობიეტში უნდა იყოს სულ მცირე 5 კუთვნილება, ყველა ობიექტს უნდა ჰქონდეს ერთი და იგივე კუთვნილებები
მაგრამ განსხვავებული მნიშვნელობები, ახსენით კომენტარებით რა არის ობიექტი (აუცილებელია)*/

const obj1={
    name : "zuka",
    age : "16",
    height : "182cm",
    weight : "76kg"
}
const obj2={
    name : "saba",
    age : "16",
    height : "178cm",
    weight : "65kg"
}
const obj4={
    name : "gio",
    age : "16",
    height : "173cm",
    weight : "75kg"
}

/*ობიექტი არის ყველაფერი ის რასაც ვხედავთ, ვეხებით და გააჩნია საკუთარი მახასიათებლები*/