'''შექმენით პროგრამა სადაც მომხმარებელი შემოიტანს 5 რციხვს, ხოლო ამ 5 რიცხვს შორის გამოიყენეთ ყველა არითმეტიკული ოპერაცია 
(+,-,*,/,%,//), საბოლოოდ დაბეჭდეთ შედეგები ტერმინალში + 
ახსენით თითოეული ნაწილი კოდის რატომ დაწერეთ კონკრეტული ხაზი და რას აკეთებს.'''


num1 = int(input())
num2 = int(input())
num3 = int(input())
num4 = int(input())
num5 = int(input())  
# int() ფუნქცია რომ არ გამოგვეყენებინა ჩვენ მიერ input_ში შეყვანილი ციფრებს კომპიუტერი string_ად აღიქვამდა

print(num1+num2)
print(num3-num2)
print(num4/num2)
print(num5*num3)
print(num5%num3)

